import React from 'react';
import ToDoComponent from './ToDoComponent';  
import './App.css';
// 1. Підключити JSON-server. Команда запуску серверу “json-server --watch db.json --port 3030 --delay 2000”
// 2. Тепер при першому вході у додаток має іти запит GET на отримання всіх todo. (Дивись як має виглядати структура отриманих даних).
// 3. Якщо todo ще не додані має показуватись текст приклад: “Наразі у вас немає щє завдань” і кнопка додати todo.
// 4. При натисканні на додати todo мають зʼявлятись поля для додавання. (Назва todo, Опис todo, Checkbox виконана чи ні).
// 5. Після заповнення полів і натискання “додати” має іти POST запит на додавання туду з полями як в структурі данних на картинці.
// 6. Біля кожної todo має бути кнопка “редагувати” при натисканні на неї має відкритись нове вікно і піти GET запит безпосередньо на цю todo, де мають
// бути ті самі поля що і при додаванні але поля мають бути вже заповнені стосовно отриманної з сервера todo (мають мати можливість для редагування).
// І кнопка “зберігти”.
// 7. При натисканні на кнопку зберегти має іти PUT запит на редагування todo.
// 8. Не забуваємо і про DELETE запит. При видаленні todo має видалятись також з JSON файла.
// 9. Всі завантаження мають бути оброблені (спіннер чи якийсь ще лоадер).
// 10. При отриманні помилки з сервера вона теж має бути оброблена.
// 11. (Не обовʼязково) Зробити все за допомогою бібліотеки react-query
function App() {
  return (
    <div className="App">
      <header className="App-header">
        <ToDoComponent />
      </header>
    </div>
  );
}

export default App;
